---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.ExternalDataInstanceAddingIntoDocumentEventArgs
source: html/509d2b0b-10aa-c61b-02df-871a4ff25d0b.htm
---
# ExternalDataInstanceAddingIntoDocumentEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.